Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: Compare the return value from the printNumberOfRooms call against nil to see if the method call was successful:
ja: printNumberOfRooms呼び出しからの戻り値をnilと比較して、そのメソッドがうまく呼び出されたか見てください：

source: Comparing Strings
ja: 文字列を比較する

source: Comparing Structures and Classes
ja: 構造体とクラスを比較する

source: Comparison Operators
ja: 比較演算子

source: Comparison operators are often used in conditional statements, such as the if statement:
ja: 比較演算子は、条件文においてしばしば使われます、例えばif文など：

source: Comparisons like i == 1 are discussed in Basic Operators.
ja: i == 1のような比較は「基本の演算子」で議論されます。

source: Compile-Time Diagnostic Statement
ja: コンパイル時診断文

source: Compiler Control Statements
ja: コンパイラ制御文

source: Compiler control statements allow the program to change aspects of the compiler’s behavior and include a conditional compilation block and a line control statement.
ja: コンパイラ制御文は、プログラムにコンパイラの挙動のいろいろな面を変更できるようにします、そして条件コンパイルブロックと行制御文を含みます。

source: Compiler control statements allow the program to change aspects of the compiler’s behavior.
ja: コンパイラ制御文は、プログラムに、コンパイラの挙動の様々な面を変更できるようにします。

source: Compound Assignment Operators
ja: 複合代入演算子

source: Compound Cases
ja: 複合ケース節

source: Compound cases can also include value bindings.
ja: 複合ケース節はまた、値束縛を含むことができます。

source: Computed Properties
ja: 計算プロパティ

source: Computed Variables and Computed Properties
ja: 計算変数と計算プロパティ

source: Computed properties are provided by classes, structures, and enumerations.
ja: 計算プロパティは、クラス、構造体、および列挙で提供されます。

source: Computed type properties are always declared as variable properties, in the same way as computed instance properties.
ja: 計算型プロパティは、計算インスタンスプロパティと同じ方法で、常に変数プロパティとして宣言されます。

source: Computed variables calculate their value, rather than storing it, and they are written in the same way as computed properties.
ja: 計算変数は値を計算します、それの貯蔵ではなくて、そして計算プロパティと同じ方法で書かれます。

source: Concatenating Strings and Characters
ja: 文字列と文字の連結

source: Conditional Compilation Block
ja: 条件コンパイルブロック

source: Conditional Conformance
ja: 条件準拠

source: Conditional Statements
ja: 条件つきの文

source: Conditional compilation blocks that contain multiple branches have the following form:
ja: 複数の分岐を含む条件コンパイルブロックは、以下の形式を持ちます：

source: Conditional statements such as the if statement are covered in more detail in Control Flow.
ja: if文のような条件つきの文は、更に詳細に「制御の流れ」で扱われます。

source: Conditionally Conforming to a Protocol
ja: あるプロトコルに条件付きで準拠する

source: Conflicting Access to In-Out Parameters
ja: in-outパラメータに対するアクセスの衝突

source: Conflicting Access to Properties
ja: プロパティに対するアクセスの衝突

source: Conflicting Access to self in Methods
ja: メソッドの中でのselfに対するアクセスの衝突

source: Conform to protocols to provide standard functionality of a certain kind
ja: 特定の種類の標準の機能性を提供するために、プロトコルに準拠します

source: Consider drawing the tick marks for every minute on a watch face.
ja: 時計盤上のすべての分表示に目盛りを描画することを考えてください。

source: Consider this example, which uses the Resolution structure from the previous example:
ja: この例を考慮してください、それは、前の例からResolution構造体を使用します：

source: Consider two arrays of integers, one where all the elements are the same, and one where they aren’t:
ja: いくつかの整数からなる２つの配列を考えてください、すべての要素が同じであるもの、そしてそうではないもの：

source: Constant Declaration
ja: 定数宣言

source: Constant and variable names can contain almost any character, including Unicode characters:
ja: 定数と変数の名前は、ユニコード文字を含めて、ほとんどどんな文字でも含むことができます：

source: Constant and variable names can’t contain whitespace characters, mathematical symbols, arrows, private-use Unicode scalar values, or line- and box-drawing characters.
ja: 定数と変数の名前は、空白文字、数学記号、矢印、私的使用Unicodeスカラー値、または罫線文字を含むことができません。

source: Constant declarations are declared using the let keyword and have the following form:
ja: 定数宣言は、letキーワードを使用して宣言され、以下の形式を持ちます：

source: Constant declarations are not computed properties and therefore do not have getters or setters.
ja: 定数宣言は、計算プロパティではなく、したがって、ゲッターまたはセッターを持ちません。

source: Constant properties must always have a value before initialization completes, and therefore cannot be declared as lazy.
ja: 定数プロパティは常に値を、初期化が完了する前に持たなければなりません、それゆえに遅延であると宣言されることが出来ません。

source: Constants and Variables
ja: 定数と変数

source: Constants and variables are still explicitly typed, but much of the work of specifying their type is done for you.
ja: 定数と変数は依然として明確に型を決められます、しかしそれらの型を指定する行為のほとんどは、あなたのために行われます。

source: Constants and variables associate a name (such as maximumNumberOfLoginAttempts or welcomeMessage) with a value of a particular type (such as the number 10 or the string "Hello").
ja: 定数と変数は、ひとつの名前（例えばmaximumNumberOfLoginAttemptsまたはwelcomeMessageなど）を特定の型のひとつの値（例えば数10または文字列"Hello"など）と結びつけます。

source: Constants and variables created with optional binding in an if statement are available only within the body of the if statement.
ja: if文の中でオプショナル束縛を使って作成された定数と変数は、そのif文の本文の内部でのみ利用可能です。

source: Constants and variables must be declared before they’re used.
ja: 定数と変数は、それらが使われる前に宣言されなければなりません。

source: Constants and variables of type Any can now contain function instances.
ja: 型Anyの定数と変数は、今では関数インスタンスを含みます。

source: Constants and variables of type Barcode can store either a .upc or a .qrCode (together with their associated values), but they can store only one of them at any given time.
ja: 型Barcodeの定数と変数は、.upcまたは.qrCodeのどちらでも（それらの関連値と共に）格納することができます、しかしそれらはどんな時でもそれらの１つを格納することだけができます。

source: Constants can now be declared without being initialized in local function scope.
ja: 定数は今では初期化されることなくローカル関数のスコープ内で宣言されることができます。

source: Constants, Variables, Properties, and Subscripts
ja: 定数、変数、プロパティ，そして添え字

source: Continue Statement
ja: 継続文

source: Control Flow
ja: 制御の流れ

source: Control Transfer Statements
ja: 制御移動文

source: Control flow in a loop statement can be changed by a break statement and a continue statement and is discussed in Break Statement and Continue Statement below.
ja: ループ文の中の制御の流れは、break文そしてcontinue文によって変えられることができます、そして下記のブレーク文と継続文で議論されます。

source: Control flow in an if statement or a switch statement can be changed by a break statement and is discussed in Break Statement below.
ja: if文またはswitch文の中の制御の流れは、break文によって変えられることができます、それは下記のブレーク文で議論されます。

source: Control flow statements are used to control the flow of execution in a program.
ja: 制御の流れ文は、プログラムにおいて実行の流れを制御するために使われます。

source: Control transfer statements are discussed in Control Transfer Statements below.
ja: 制御移動文は、下の制御移動文で議論されます。

source: Control transfer statements can change the order in which code in your program is executed by unconditionally transferring program control from one piece of code to another.
ja: 制御移動文は、あなたのプログラムの中のコードが実行される順番を、プログラム制御を１つのコード片から他のものまで無条件に移すことによって変えることができます。

source: Convenience initializers are written in the same style, but with the convenience modifier placed before the init keyword, separated by a space:
ja: 便宜イニシャライザは同じ形式で書かれます、しかしconvenience修飾子がinitキーワードの前に空白で区切って置かれます：

source: Convenience initializers can delegate the initialization process to another convenience initializer or to one of the class’s designated initializers.
ja: 便宜イニシャライザは、初期化プロセスを別の便宜イニシャライザに、またはそのクラスの指定イニシャライザのうちの１つに委任することができます。

source: Convenience initializers can’t call a superclass’s initializers.
ja: 便宜イニシャライザは、スーパークラスのイニシャライザを呼ぶことができません。

source: Convenience initializers must always delegate across.
ja: 便宜イニシャライザは、常に横に委任しなければなりません。

source: Conversely, LATIN CAPITAL LETTER A (U+0041, or "A"), as used in English, is not equivalent to CYRILLIC CAPITAL LETTER A (U+0410, or "А"), as used in Russian.
ja: 反対に、英語で使われるような、LATIN CAPITAL LETTER A（U+0041、または"A"）は、ロシアで使われるような、CYRILLIC CAPITAL LETTER A（U+0410、または"А"）と等しくありません。

source: Conversely, define a capture as a weak reference when the captured reference may become nil at some point in the future.
ja: 逆に、捕らえられた参照が将来どこかの時点でnilになるかもしれないときは、捕獲を弱い参照として定義してください。

source: Conversely, if you write a subclass initializer that matches a superclass convenience initializer, that superclass convenience initializer can never be called directly by your subclass, as per the rules described above in Initializer Delegation for Class Types.
ja: 逆に言えば、上記のクラス型のためのイニシャライザ委任で記述される規則どおりに、あなたがスーパークラスの便宜イニシャライザに一致するサブクラスのイニシャライザを書くならば、そのスーパークラスの便宜イニシャライザは直接にあなたのサブクラスによって呼び出されることが決してできません。

source: Conversely, set b is a subset of set a, because all elements in b are also contained by a.
ja: 逆に言えば、集合bは集合aの下位集合です、bの要素すべてはaによってまた含まれるからです。

source: Conversions between integer and floating-point numeric types must be made explicit:
ja: 整数と浮動小数点数型の間の変換は、明示的に行われる必要があります：

source: Converting Errors to Optional Values
ja: エラーをオプショナルの値に変換する

source: Corrected the discussion of the @NSApplicationMain attribute in the Declaration Attributes section.
ja: @NSApplicationMain属性の解説を宣言属性の節において訂正した。

source: Counting Characters
ja: 文字を数える

source: Create a constant with an explicit type of Float and a value of 4.
ja: 明確にFloatの型で値4の定数をつくってください。

source: Create an instance of a class by putting parentheses after the class name.
ja: クラス名の後に丸括弧を置くことによって、クラスのインスタンスをつくってください。

source: Create arrays and dictionaries using brackets ([]), and access their elements by writing the index or key in brackets.
ja: 角括弧（[]）を使って配列および辞書（連想配列）を作ってください、そしてインデックスまたはキーを角括弧の中に記述することによってそれらの要素にアクセスしてください。

source: Create convenience initializers whenever a shortcut to a common initialization pattern will save time or make initialization of the class clearer in intent.
ja: 共通の初期化の繰り返しに対する近道が時間を節約したり、そのクラスの初期化を意図においてより明白にするときはいつでも、便宜イニシャライザをつくってください。

source: Creating a Dictionary with a Dictionary Literal
ja: 辞書を辞書リテラルで作成する

source: Creating a Set with an Array Literal
ja: 集合を配列リテラルで作成する

source: Creating an Array by Adding Two Arrays Together
ja: ２つの配列を一緒にすることで１つの配列を作成する

source: Creating an Array with a Default Value
ja: 配列を１つの初期値で作成する

source: Creating an Array with an Array Literal
ja: 配列を配列リテラルで作成する

source: Creating an Empty Array
ja: 空の配列の作成

source: Creating an Empty Dictionary
ja: 空の辞書を作成する

source: Creating and Initializing an Empty Set
ja: 空の集合の作成と初期化

source: Custom Operators
ja: あつらえの演算子

source: Custom Types
ja: あつらえの型

source: Custom infix operators each belong to a precedence group.
ja: あつらえの接中辞演算子それぞれは、ある優先順位グループに属しています。

source: Custom initializers can be assigned an access level less than or equal to the type that they initialize.
ja: あつらえのイニシャライザは、それらが初期化する型と同じか低いアクセス水準を割り当てられることができます。

source: Custom operators can begin with one of the ASCII characters /, =, -, +, !, *, %, <, >, &, |, ^, ?, or ~, or one of the Unicode characters defined in the grammar below (which include characters from the Mathematical Operators, Miscellaneous Symbols, and Dingbats Unicode blocks, among others).
ja: あつらえの演算子は、ASCII文字/、=、-、+、!、*、%、<、>、&、|、^、?、および~のうちの１つ、または以下の文法において定義されるユニコード文字のうちの１つで始まります（それはMathematical Operators、Miscellaneous Symbols、そしてDingbatsユニコードブロックなどからの文字を含みます）。

source: Custom operators can now contain the ? character.
ja: あつらえの演算子は、今では?文字を含みます。

source: Custom types state that they adopt a particular protocol by placing the protocol’s name after the type’s name, separated by a colon, as part of their definition.
ja: あつらえの型は、それが特定のプロトコルを採用することを、型の名前の後に、コロンで区切って、それらの定義の一部としてプロトコルの名前を置くことによって示します。

source: Customizing Initialization
ja: 初期化をカスタマイズする

source: Data types that are normally considered basic or primitive in other languages—such as types that represent numbers, characters, and strings—are actually named types, defined and implemented in the Swift standard library using structures.
ja: 他の言語で通常は基本的またはプリミティブであるとみなされるデータ型 ― 例えば数、文字、そして文字列を表す型 ― これらは実際に名前付きの型で、構造体を使用してスウィフト標準ライブラリにおいて定義および実装されます。

source: DataImporter is a class to import data from an external file.
ja: （DataImporterは、データを外部ファイルからインポートするクラスです。）

source: Debugging with Assertions
ja: 表明を使ってデバッグする

source: Decimal floating-point literals consist of a sequence of decimal digits followed by either a decimal fraction, a decimal exponent, or both.
ja: 10進の浮動小数点リテラルは、一連の10進の桁に、小数部か10進の指数のどちらか、または両方が続くものから成ります。

source: Decimal floats can also have an optional exponent, indicated by an uppercase or lowercase e; hexadecimal floats must have an exponent, indicated by an uppercase or lowercase p.
ja: 10進浮動小数点はまた、任意に指数を持つことができ、大文字か小文字のeで示されます；16進浮動小数点は、指数を持つ必要があり、大文字か小文字のpで示されます。

source: Decimal literals contain the digits 0 through 9.
ja: 10進のリテラルは、0から9までの桁を含みます。

source: Declaration Attributes
ja: 宣言属性

source: Declaration Attributes Used by Interface Builder
ja: インターフェイスビルダーで使用される宣言属性

source: Declaration Modifiers
ja: 宣言修飾子

source: Declarations
ja: 宣言

source: Declarations in a protocol extension can’t be marked final.
ja: プロトコル拡張の中の宣言は、finalで印されることができません。

source: Declarations marked with the inlinable attribute are implicitly usable from inlinable code.
ja: inlinable属性で印される宣言は、暗黙的にインライン可能コードから利用可能です。

source: Declarations marked with the open access-level modifier can also be accessed and subclassed by code in a module that imports the module that contains that declaration.
ja: openアクセス水準修飾子で印される宣言はまた、アクセスされることおよびサブクラスを作られることが、その宣言を含むモジュールをインポートするモジュール内のコードによって可能です。

source: Declarations marked with the public access-level modifier can also be accessed (but not subclassed) by code in a module that imports the module that contains that declaration.
ja: publicアクセス水準修飾子で印される宣言はまた、アクセスされる（しかしサブクラスは作られない）ことが、その宣言を含むモジュールをインポートするモジュール内のコードによって可能です。

source: Declare a private member in an extension, and access that member from the original declaration in the same file.
ja: ある非公開メンバをある拡張の中で宣言する、そしてそのメンバに対して同じファイル中のオリジナルの宣言からアクセスする。

source: Declare a private member in one extension, and access that member from another extension in the same file.
ja: ある非公開メンバを一方の拡張の中で宣言する、そしてそのメンバに対して同じファイル中の別の拡張からアクセスする。

source: Declare a private member in the original declaration, and access that member from extensions in the same file.
ja: ある非公開メンバをオリジナルの宣言の中で宣言する、そしてそのメンバに対して同じファイル中の拡張からアクセスする。

source: Declare extensions with the extension keyword:
ja: extensionキーワードによって拡張を宣言してください：

source: Declaring Constants and Variables
ja: 定数と変数の宣言

source: Declaring Protocol Adoption with an Extension
ja: 拡張を使ってプロトコル採用を宣言する

source: Default Access Levels
ja: 省略時のアクセス水準

source: Default Initializers
ja: 省略時のイニシャライザ

source: Default Memberwise Initializers for Structure Types
ja: 構造体体型のための省略時のメンバー関連イニシャライザ

source: Default Parameter Values
ja: 省略時のパラメータ値

source: Default Property Values
ja: 省略時のプロパティ値

source: Default values, however, can’t be specified for method parameters within a protocol’s definition.
ja: 省略時の値は、しかしながら、プロトコル定義の内部のメソッドパラメーターに対して指定されることはできません。

source: Defer Statement
ja: defer文

source: Deferred actions are executed in the reverse of the order that they’re written in your source code.
ja: 延期された動作は、それらがあなたのソースコードに書かれた順序の逆に実行されます。

source: Define a capture in a closure as an unowned reference when the closure and the instance it captures will always refer to each other, and will always be deallocated at the same time.
ja: それが捕らえるクロージャとインスタンスが常にお互いに言及して、常に同時に割り当て解除されるときは、クロージャにおいて捕獲を非所有参照として定義してください。

source: Define and use new nested types
ja: 新しい入れ子にされた型を定義して、使用する

source: Define initializers to set up their initial state
ja: それらの初期状態を設定するために、イニシャライザを定義します

source: Define instance methods and type methods
ja: インスタンスメソッドと型メソッドを定義する

source: Define methods to provide functionality
ja: 機能性を提供するために、メソッドを定義します

source: Define properties to store values
ja: 値を格納するために、プロパティを定義します

source: Define subscripts
ja: 添え字を定義する

source: Define subscripts to provide access to their values using subscript syntax
ja: 添え字構文を使用してそれらの値の利用することを提供するために、添え字を定義します

source: Define the access level for an entity by placing one of the open, public, internal, fileprivate, or private modifiers at the beginning of the entity’s declaration.
ja: ある実在にアクセス水準を定義するには、open、public、internal、fileprivate、またはprivate修飾子のうちの１つをその実在の宣言の始まりに置いてください。

source: Defining Model Classes for Optional Chaining
ja: オプショナル連鎖のモデル・クラスを定義する

source: Defining a Base Class
ja: 基盤クラスを定義すること

source: Defining a Capture List
ja: 捕獲リストの定義

source: Defining a Class Hierarchy for Type Casting
ja: 型キャストのためにクラス階層を定義する

source: Defining a call-as-function method, or a method from the dynamicCallable attribute, doesn’t let you use an instance of that type as if it were a function in any context other than a function call expression.
ja: call-as-functionメソッド、またはdynamicCallable属性からのメソッドを定義することは、あなたにその型のインスタンスを使わせません、まるでそれが関数呼び出し式と違う何か他の文脈での関数だったかのようには。

source: Defining and Calling Functions
ja: 関数の定義と呼び出し

source: Definition Syntax
ja: 定義構文

source: Deinitialization
ja: デイニシャライズ

source: Deinitializer Declaration
ja: デイニシャライザ宣言

source: Deinitializers are called automatically, just before instance deallocation takes place.
ja: デイニシャライザは、インスタンスの割り当て解除が起こる直前に、自動的に呼ばれます。

source: Deinitializers are not called directly.
ja: デイニシャライザは、直接に呼ばれません。

source: Deinitializers are only available on class types.
ja: デイニシャライザは、クラス型で利用可能なだけです。

source: Deinitializers enable an instance of a class to free up any resources it has assigned.
ja: デイニシャライザは、クラスのインスタンスにそれが代入したどんなリソースでも解放するのを可能にします。

source: Deinitializers in Action
ja: デイニシャライザの動作

source: Deinitializers take no parameters and have the following form:
ja: デイニシャライザは、パラメータを取らない以下の形式を持ちます：

source: Delaying evaluation is useful for code that has side effects or is computationally expensive, because it lets you control when that code is evaluated.
ja: 評価を遅らせることは、副作用を持つまたは計算的に高くつくコードに対して有用です、なぜならそれがあなたに何時そのコードが評価されるかを制御させるからです。

source: Delegation
ja: 委任

source: Delegation can be used to respond to a particular action, or to retrieve data from an external source without needing to know the underlying type of that source.
ja: 委任は、特定の動作に応答したり、外部ソースからそのソースの根底の型を知る必要なしにデータを取り出したりするのに使われることができます。

source: Designated Initializers and Convenience Initializers
ja: 指定イニシャライザと便宜イニシャライザ

source: Designated and Convenience Initializers in Action
ja: 指定および便宜イニシャライザの動作

source: Designated initializers and deinitializers must always be provided by the original class implementation.
ja: 指定イニシャライザとデイニシャライザは、常に最初のクラス実施によって提供されなければなりません。

source: Designated initializers are “funnel” points through which initialization takes place, and through which the initialization process continues up the superclass chain.
ja: 指定イニシャライザは、「漏斗」地点です、そこを通して初期化が行われ、そこを通して初期化処理がスーパークラス連鎖を上って続いていきます。

source: Designated initializers can be declared in the context of a class declaration only and therefore can’t be added to a class using an extension declaration.
ja: 指定イニシャライザは、クラス宣言の文脈においてのみ宣言されることができて、したがって拡張宣言を使ってあるクラスに加えられることはできません。

source: Designated initializers for classes are written in the same way as simple initializers for value types:
ja: クラスのための指定イニシャライザは、値型のための単純なイニシャライザと同様に書かれます：

source: Designated initializers must always delegate up.
ja: 指定イニシャライザは、常に上に委任しなければなりません。

source: Despite this simplicity of syntax, Swift’s String type is a fast, modern string implementation.
ja: 構文のこの単純さにもかかわらず、スウィフトのString型は、速く、現代的な文字列の実装です。

source: Dictionaries
ja: 辞書

source: Dictionaries are an unordered collection, so their keys and values are iterated over in an arbitrary order.
ja: 辞書は、順序付けられないコレクションです、なのでそのキーと値は気まぐれな順番で繰り返されていきます。

source: Dictionaries are unordered collections of key-value associations.
ja: 辞書は、「キーと値」を結びつけたものの順番をつけられないコレクションです。

source: Dictionary Type
ja: 辞書型

source: Dictionary Type Shorthand Syntax
ja: 辞書型の略記構文

source: Differences Between Opaque Types and Protocol Types
ja: 不透明型とプロトコル型の間の違い

source: Digit 0 or 1
ja: アラビア数字の0または1

source: Digit 0 through 7
ja: アラビア数字の0から7

source: Digit 0 through 9
ja: アラビア数字の0から9

source: Digit 0 through 9, a through f, or A through F
ja: アラビア数字の0から9、aからf、またはAからF

source: Disabling Error Propagation
ja: エラー伝達を抑制する

source: Distinguishing among these different situations allows a program to resolve some errors and to communicate to the user any errors it can’t resolve.
ja: これらの異なった状況を区別することは、プログラムにいくらかのエラーを解消すること、そしてなんらかのそれが解消できないエラーを利用者に伝えることを可能にします。

source: Division (/)
ja: 除算（/）

source: Do Statement
ja: do文

source: Do this by placing an exclamation point after the init keyword (init!) instead of a question mark.
ja: これを、疑問符ではなく、感嘆符をinitキーワードの後に置くこと（init!）によって行ってください。

source: Do this by writing the final modifier before the method, property, or subscript’s introducer keyword (such as final var, final func, final class func, and final subscript).
ja: メソッド、プロパティ、または添え字の導入子キーワードの前にfinal修飾子を書くことによって、これをしてください（例えば、final var、final func、final class func、そしてfinal subscriptなど）。

source: Document Revision History
ja: 文書改訂履歴

source: Doing so clarifies that you intend to provide an override and have not provided a matching definition by mistake.
ja: そうすることは、あなたがオーバーライドを提供するつもりであって、誤って同じ定義を提供したのでないことを明らかにします。

source: Doing so is consistent with the label’s use alongside the break statement and helps make the game’s logic clearer to read and understand.
ja: そうすることは、break文と並べるとラベルの使用で調和して、ゲームの論理を読み取って理解するのをより明快にする助けとなります。

source: Doing so makes it easier for you to reason about your code and enables the Swift compiler to optimize the performance of the collections you create.
ja: そうすることは、あなたがあなたのコードについて推論するのをより容易にして、スウィフトのコンパイラにあなたが作成するコレクションの運用性能を最適なものにすることを可能にします。

source: Don’t use an implicitly unwrapped optional when there’s a possibility of a variable becoming nil at a later point.
ja: ある変数がその後のある時点でnilになる可能性がある時には、暗黙的にアンラップされるオプショナルを使用しないでください。

source: Don’t worry if you are not familiar with the concept of capturing.
ja: あなたがキャプチャの概念に馴染みがなくても、心配いりません。

source: Don’t worry if you don’t understand something—everything introduced in this tour is explained in detail in the rest of this book.
ja: わからないことがあっても心配することはありません ― このツアーにおいて紹介されるすべてのことは、この本の残りで詳細に説明されます。

source: Double quotation mark (\")
ja: 二重引用符（\"）

source: Downcasting
ja: ダウンキャスト

source: Downcasting to Movie fails when applied to the Song instances in the library array.
ja: Movieにダウンキャストすることは、library配列のSongインスタンスに適用されるとき失敗します。

source: Dynamic member lookup by key path can be used to implement a wrapper type in a way that supports compile-time type checking.
ja: キーパスによる動的メンバー検索は、ラッパー型を、コンバイル時型検査をサポートするある方法で実装するために使用できます。

source: Dynamic member lookup by member name can be used to create a wrapper type around data that can’t be type checked at compile time, such as when bridging data from other languages into Swift.
ja: メンバー名による動的メンバー検索は、コンパイル時に型検査されることができないデータを取り囲むラッパー型を作成するために使用できます、たとえば他の言語からスウィフトへとブリッジしている時など。

source: Each Player instance is initialized with a starting allowance of a specified number of coins from the bank during initialization, although a Player instance may receive fewer than that number if not enough coins are available.
ja: 各Playerインスタンスは、初期化の間に、胴元からの指定された数のコインの開始手当で初期化されます、とは言え、十分なコインが利用可能でなければPlayerインスタンスはその数より少ないものを受け取るかもしれません。

source: Each String value has an associated index type, String.Index, which corresponds to the position of each Character in the string.
ja: それぞれのString値は、結び付けられたインデックス型、String.Indexを持ちます、それは、各Characterのその文字列中での位置に対応しています。

source: Each UnicodeScalar has a value property that returns the scalar’s 21-bit value, represented within a UInt32 value:
ja: 各UnicodeScalarはひとつのvalueプロパティを持ちます、それはそのスカラーの21ビットの値を返します、そしてそれはUInt32値の範囲内で表されます：

source: Each Starship class instance stores a mandatory name and an optional prefix.
ja: 各Starshipクラスインスタンスは、義務的なnameそしてオプショナルのprefixを格納します。

source: Each case compares that value to a number or interval.
ja: 各caseは、その値をある数または区間と比較します。

source: Each access-level modifier above optionally accepts a single argument, which consists of the set keyword enclosed in parentheses (for example, private(set)).
ja: 上記のそれぞれのアクセス水準修飾子は、任意に１つだけの引数を受け入れます、それは丸括弧に囲まれたキーワードsetからなります（例えば、private(set)）。

source: Each approach is described in a section below.
ja: 各取り組みは、以下の節で記述されます。
